[
  {
    "title": "The Season is Going Great for Scotland United Knights",
    "image": "https://jodeaux.agency/assets/img/portfolio/sb_suk_img_tiny.webp",
    "description": "Well, would you look at that! Your Scotland United Knights are officially Cobra Killers! We slayed those Midland reptiles and emerged victorious. It was a game for the ages, folks. The kind of game that makes you want to don a kilt, grab a pint, and shout “Freedom!” at the top of your lungs.",
    "url": "https://www.sbbs.online/blog-post-1"
  },
  {
    "title": "The Glass Castle",
    "image": "https://jodeaux.agency/assets/img/portfolio/sbms_lake_img_mini.png",
    "description": "Scotland Middle School. The Glass Castle. A name that evokes images of towering spires, stained glass windows, and a touch of fairytale magic. And while the exterior certainly lives up to the name, the interior of this historic building holds secrets far more extraordinary than any fairy tale.",
    "url": "https://www.sbbs.online/blog-post-2"
  },
  {
    "title": "The Amulet of Ardvorlich",
    "image": "https://jodeaux.agency/assets/img/portfolio/sb_amuletimg2_tiny.webp",
    "description": "Our quaint little town of Scotland, Washington - nestled in the Pacific Northwest of America, is known for its friendly neighbors, apple pie, and the annual summer festival. But what lies beneath the surface of this idyllic community is a secret so old, so dark, it could shake the very foundations of our world.",
    "url": "https://www.sbbs.online/blog-post-3"
  },
  {
    "title": "Scotland, Washington: A Town Beyond Belief",
    "image": "https://jodeaux.agency/assets/img/portfolio/welcometoscotland_img_tiny.webp",
    "description": "Nestled in the heart of the Pacific Northwest, the enigmatic town of Scotland, Washington, is a place where history and mystery intertwine in a way that defies explanation. Founded by the enigmatic Sir Knox McGregor, a man who seemed to defy the passage of time, the town has always been shrouded in an aura of intrigue.",
    "url": "https://www.sbbs.online/blog-post-4"
  },
  {
    "title": "BlueHand: The Shadow Over Scotland, WA",
    "image": "https://jodeaux.agency/assets/img/portfolio/bluehand_img_tiny.webp",
    "description": "Beneath the facade of a global conglomerate, BlueHand is a monstrous entity with tentacles reaching into the darkest corners of the world. And at the heart of its sinister operations lies the quiet, unassuming town of Scotland, Washington.",
    "url": "https://www.sbbs.online/blog-post-5"
  }
]
